Revit 2027 API
FabricationConfiguration.GetSeamName Method
 Gets the seam name from its database identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetSeamName(
	int seamId
)
Public Function GetSeamName (
	seamId As Integer
) As String
public:
String^ GetSeamName(
	int seamId
)
member GetSeamName :
        seamId : int -> string
Parameters
seamId Int32
 The seam database identifier.
Return Value
String
 The seam name.
Exceptions
Exception | Condition
ArgumentException |  The seam does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace